#+startup: latexpreview
#+include: "~/org/header.org"
#+latex_header: \usepackage{tikz}

#+begin_center
*Лабораторная 4*

Моисеев M32001, Муров M32011

Вариант 3
#+end_center

#+latex: \clearpage

** Система уравнений стационарных вероятностей

\begin{cases}
\mu p_1 - \lambda p_0 = 0 \\
2 \mu p_2 + \lambda p_0 - (\lambda + \mu) p_1 = 0 \\
2 \mu p_3 + \lambda p_1 - (\lambda + 2 \mu) p_2 = 0 \\
\lambda p_2 - 2 \mu p_3 = 0 \\
p_0 + p_1 + p_2 + p_3 = 1
\end{cases}

#+begin_src python :exports results :cache yes
import numpy as np

lam = 1.7
mu = 3.6

a = np.array([
    [-lam, mu, 0, 0],
    [lam, -(lam + mu), 2*mu, 0],
    [0, lam, -(lam + 2*mu), 2*mu],
    [1, 1, 1, 1],
])
b = np.array([0, 0, 0, 1])

return np.linalg.solve(a, b)
#+end_src

#+RESULTS:
| 0.62110073 | 0.29329757 | 0.06925081 | 0.01635089 |

